user-4.0/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/0.org/region_fluid/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
        type            slip;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
//     atmosphere
//     {
//         type            inletOutlet;
//         inletValue      uniform 0;
//         value           uniform 0;
//     }
    atmosphere
    {
        type            slip;
    }
    sideWall
    {
        type            zeroGradient;
//         type            constantAlphaContactAngle;
//         theta0          90;
//         value           $internalField;
//         type            dynamicAlphaContactAngle;
//         theta0          90;
//         uTheta          1.0;
//         thetaA          120;
//         thetaR          60;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}


// ************************************************************************* //
