user-4.0/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ************************* SIMLUTAITON TIMES ***************************** //

application         interEddyCurrentFoam;

startFrom           latestTime;

startTime           0.0;

stopAt              endTime;

endTime             3.0;

// *************************** TIME STEPPING ******************************* //

deltaT              0.00000001;

adjustTimeStep      yes;

maxCo               0.5;

maxDeltaT           0.001;

// *************************** OUTPUT SETTINGS ***************************** //

writeControl        adjustableRunTime;
// writeControl        timeStep;

writeInterval       0.01;
// writeInterval       1;

purgeWrite          0;

cycleWrite          0;

writeFormat         binary;
// writeFormat         ascii;

writePrecision      8;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       8;

// **************************** OTHER SETTINGS ***************************** //

runTimeModifiable   yes;

// OptimisationSwitches
// {
//     commsType       nonBlocking;
// }

// ******************************* SAMPLING ******************************** //

functions
(
    freeSurface
    {
        type                   surfaces;
        functionObjectLibs     ("libsampling.so");
        outputControl          outputTime;
        outputInterval         1;
        surfaceFormat          raw;
        region                 region_fluid;
        fields                 (alpha1);
        surfaces
        (
            freeSurface
            {
                type           isoSurfaceCell;
                isoField       alpha1;
                isoValue       0.5;
                interpolate    yes;
                regularise     yes;
            }
        );
        interpolationScheme    cell;
    }
);

// ************************************************************************* //
