user-4.0/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/system/region_fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pFinal
//     {
//         solver                GAMG;
//         tolerance             1e-08;
//         relTol                0;
//
//         smoother              GaussSeidel;
//         nPreSweeps            0;
//         nPostSweeps           2;
//         cacheAgglomeration    on;
//         agglomerator          faceAreaPair;
//         nCellsInCoarsestLevel 80;
//         mergeLevels           1;
//     }
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }

    p { $pFinal; relTol 1e-2; }

    "(UFinal|epsilon|omega|k|nuTilda)"
    {
        solver                   PBiCG;
        tolerance                1e-07;
        relTol                   0;
        preconditioner           DILU;
    }

    U { $UFinal; }
}

PISO
{
    cAlpha                      6;

//     cutCompression              yes;
//     cAlphaCut                   0.001;
//     cAlphaCutRelErr             1e-5;
//     cAlphaCutPatchEnhance       2.0;

    phase1Only                  yes;
    phase1Cut                   0.01;
    phase1CutOff                0.01;

    emUpdateAlpha               yes;
    emUpdateAlphaChange         0.5;
}

PIMPLE
{
//     nOuterCorrectors            100;
    nOuterCorrectors            3;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    2;

    nAlphaCorr                  1;
    nAlphaSubCycles             4;

    pRefPoint                   (0.04 0.0 0.04);
    pRefValue                   0;

    momentumPredictor           no;

    turbOnFinalIterOnly         no;

    residualControl
    {
        U
        {
                tolerance  1e-05;
                relTol     1e-02;
        }
        p
        {
                tolerance  1e-05;
                relTol     1e-02;
        }
     }
}

// ************************************************************************* //
